#+title: Chunkeng Work File
#+author: h4soft

* Chunkeng Web Site
#+BEGIN: clocktable :scope subtree :maxlevel 4 :block 2024-07 :tags t
#+CAPTION: Clock summary at [2024-07-25 목 12:39], for 7월 2024.
| Tags         | Headline                            | Time      |         |       |      |
|--------------+-------------------------------------+-----------+---------+-------+------|
|              | *Total time*                        | *1d 5:50* |         |       |      |
|--------------+-------------------------------------+-----------+---------+-------+------|
|              | Chunkeng Web Site                   | 1d 5:50   |         |       |      |
|              | \_  Team Folder Project             |           | 1d 5:50 |       |      |
|              | \_    Review & Research             |           |         |  4:00 |      |
| 07_06        | \_      New requirement review      |           |         |       | 4:00 |
|              | \_    Development                   |           |         | 17:50 |      |
| 07_01        | \_      Score View/Edit/Delete      |           |         |       | 3:00 |
| 07_03        | \_      Team select UI              |           |         |       | 1:00 |
| 07_09        | \_      Holiday management UI       |           |         |       | 2:30 |
| 07_24        | \_      Team schedule management    |           |         |       | 3:00 |
| 07_24, 07_25 | \_      Team notes management       |           |         |       | 8:20 |
|              | \_    System Setup                  |           |         |  3:00 |      |
| 07_01        | \_      Score mangement go live     |           |         |       | 3:00 |
|              | \_    Documentation                 |           |         |  5:00 |      |
| 07_02        | \_      Score mangement user manual |           |         |       | 5:00 |
#+END:


** TODO [#A] Team Folder Project

*** TODO [#B] Review & Research                           
**** TODO New requirement review                                      :07_06:
 
:LOGBOOK:
CLOCK: [2024-07-06 토 09:30]--[2024-07-06 토 13:30] =>  4:00
:END:

*** TODO [#B] Development                                  
**** TODO Backend API Development

      - [X] Go-API
      - [X] STRAPI

**** TODO Team member view

**** DONE Score View/Edit/Delete                                      :07_01:
CLOSED: [2024-07-06 토 07:53]
  
:LOGBOOK:
CLOCK: [2024-07-01 월 13:00]--[2024-07-01 월 16:00] =>  3:00
:END:

**** DONE Team select UI                                              :07_03:

CLOSED: [2024-07-23 화 16:20]
:LOGBOOK:
CLOCK: [2024-07-03 수 09:00]--[2024-07-03 수 10:00] =>  1:00
:END:

**** DONE Holiday management UI                                       :07_09:

CLOSED: [2024-07-23 화 16:22]
:LOGBOOK:
CLOCK: [2024-07-09 화 14:00]--[2024-07-09 화 16:30] =>  2:30
:END:

**** TODO Team schedule management                                    :07_24:

:LOGBOOK:
CLOCK: [2024-07-24 수 13:30]--[2024-07-24 수 16:30] =>  3:00
:END:

**** TODO Team notes management                                 :07_24:07_25:

:LOGBOOK:
CLOCK: [2024-07-25 목 13:30]--[2024-07-25 목 16:25] =>  2:55
CLOCK: [2024-07-25 목 07:30]--[2024-07-25 목 11:50] =>  4:20
CLOCK: [2024-07-24 수 08:00]--[2024-07-24 수 12:00] =>  4:00
:END:

*** TODO [#B] System Setup                                           
**** DONE Score mangement go live                                     :07_01:

CLOSED: [2024-07-23 화 16:09]

:LOGBOOK:
CLOCK: [2024-07-01 월 09:00]--[2024-07-01 월 12:00] =>  3:00
:END:
    

*** TODO [#C] Documentation                                          
**** DONE Score mangement user manual                                 :07_02:

CLOSED: [2024-07-02 화 16:00]
:LOGBOOK:
CLOCK: [2024-07-02 화 09:00]--[2024-07-02 화 12:00] =>  3:00
CLOCK: [2024-07-02 화 13:30]--[2024-07-02 화 15:30] =>  2:00
:END:

    - [ ] Team Home Manual


* Maintenance

* New Server Project

